In [7]:
#from pyspark.sql import SparkSession
import pandas as pd
from azure.storage.blob import BlobServiceClient
from dotenv import load_dotenv
import os

In [18]:
data = pd.read_csv('zipco_transaction.csv')
data.head()

,Date,ProductName,Quantity,UnitPrice,StoreLocation,PaymentType,PromotionApplied,Weather,Temperature,StaffPerformanceRating,...,DeliveryTime_min,OrderType,CustomerName,CustomerAddress,Customer_PhoneNumber,CustomerEmail,Staff_Name,Staff_Email,DayOfWeek,TotalSales
0,2023-01-01 00:00:00,Vanilla Cake,2,12.532304,South,Cash,True,Rainy,20.654914,Poor,...,30,In Store,William Adams,"9851 David Green\r\nTonyaburgh, VA 02853",(916)427-7276x861,lisa00@example.net,John Bridges,pdavidson@example.com,Sunday,25.064608
1,2023-01-01 01:00:00,Red Velvet Cake,1,7.083070,South,Cash,False,Rainy,23.549497,Average,...,33,In Store,Anthony Wiggins,"24682 Holly Stravenue\r\nMooreville, NH 13901",769.318.4373,michellefernandez@example.com,Sarah Bentley,ajohnson@example.net,Sunday,7.083070
2,2023-01-01 02:00:00,Chocolate Cake,5,6.736064,North,Cash,True,Rainy,NaN,Excellent,...,43,Phone Order,Ashley Duke,10184 Washington Trace Apt. 679\r\nEast Brandi...,702.520.3286,cooperwilliam@example.com,Connie Cervantes,michele29@example.net,Sunday,33.680321
3,2023-01-01 03:00:00,Carrot Cake,2,7.314823,North,Cash,False,Cloudy,20.137483,Poor,...,32,Online Order,Brandon Taylor,"87194 Jeff Rue\r\nMitchellbury, CA 50463",622-527-9530,fsilva@example.net,Jessica Stewart,xwilson@example.org,Sunday,14.629647
4,2023-01-01 04:00:00,Pizza Pepperoni,1,7.577727,East,Credit Card,True,Cloudy,23.020987,Good,...,58,In Store,Brittany Watkins,"850 Julia Groves\r\nHartview, WI 95954",759-517-8359,petersjoseph@example.net,Cheryl Carpenter,christine96@example.org,Sunday,7.577727

In [8]:
df = pd.read_csv('clean_data.csv')
df.head()

,Date,ProductName,Quantity,UnitPrice,StoreLocation,PaymentType,PromotionApplied,Weather,Temperature,StaffPerformanceRating,...,DeliveryTime_min,OrderType,CustomerName,CustomerAddress,Customer_PhoneNumber,CustomerEmail,Staff_Name,Staff_Email,DayOfWeek,TotalSales
0,2023-01-01 00:00:00,Vanilla Cake,2,12.532304,South,Cash,True,Rainy,20.654914,Poor,...,30,In Store,William Adams,"9851 David Green\r\nTonyaburgh, VA 02853",(916)427-7276x861,lisa00@example.net,John Bridges,pdavidson@example.com,Sunday,25.064608
1,2023-01-01 01:00:00,Red Velvet Cake,1,7.083070,South,Cash,False,Rainy,23.549497,Average,...,33,In Store,Anthony Wiggins,"24682 Holly Stravenue\r\nMooreville, NH 13901",769.318.4373,michellefernandez@example.com,Sarah Bentley,ajohnson@example.net,Sunday,7.083070
2,2023-01-01 02:00:00,Chocolate Cake,5,6.736064,North,Cash,True,Rainy,27.154342,Excellent,...,43,Phone Order,Ashley Duke,10184 Washington Trace Apt. 679\r\nEast Brandi...,702.520.3286,cooperwilliam@example.com,Connie Cervantes,michele29@example.net,Sunday,33.680321
3,2023-01-01 03:00:00,Carrot Cake,2,7.314823,North,Cash,False,Cloudy,20.137483,Poor,...,32,Online Order,Brandon Taylor,"87194 Jeff Rue\r\nMitchellbury, CA 50463",622-527-9530,fsilva@example.net,Jessica Stewart,xwilson@example.org,Sunday,14.629647
4,2023-01-01 04:00:00,Pizza Pepperoni,1,7.577727,East,Credit Card,True,Cloudy,23.020987,Good,...,58,In Store,Brittany Watkins,"850 Julia Groves\r\nHartview, WI 95954",759-517-8359,petersjoseph@example.net,Cheryl Carpenter,christine96@example.org,Sunday,7.577727

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1005 entries, 0 to 1004
Data columns (total 21 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Date                    1005 non-null   object
 1   ProductName             1005 non-null   object
 2   Quantity                1005 non-null   int64
 3   UnitPrice               1005 non-null   float64
 4   StoreLocation           1005 non-null   object
 5   PaymentType             1005 non-null   object
 6   PromotionApplied        1005 non-null   bool
 7   Weather                 1005 non-null   object
 8   Temperature             904 non-null    float64
 9   StaffPerformanceRating  1005 non-null   object
 10  CustomerFeedback        905 non-null    object
 11  DeliveryTime_min        1005 non-null   int64
 12  OrderType               1005 non-null   object
 13  CustomerName            1005 non-null   object
 14  CustomerAddress         1005 non-null   object
 15  Customer_PhoneNumber    1005 non-null   object
 16  CustomerEmail           904 non-null    object
 17  Staff_Name              1005 non-null   object
 18  Staff_Email             904 non-null    object
 19  DayOfWeek               1005 non-null   object
 20  TotalSales              1005 non-null   float64
dtypes: bool(1), float64(3), int64(2), object(15)
memory usage: 158.1+ KB

In [21]:
#droping duplicate row from the csv file
data.drop_duplicates(inplace=True)
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, 0 to 999
Data columns (total 21 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Date                    1000 non-null   object
 1   ProductName             1000 non-null   object
 2   Quantity                1000 non-null   int64
 3   UnitPrice               1000 non-null   float64
 4   StoreLocation           1000 non-null   object
 5   PaymentType             1000 non-null   object
 6   PromotionApplied        1000 non-null   bool
 7   Weather                 1000 non-null   object
 8   Temperature             900 non-null    float64
 9   StaffPerformanceRating  1000 non-null   object
 10  CustomerFeedback        900 non-null    object
 11  DeliveryTime_min        1000 non-null   int64
 12  OrderType               1000 non-null   object
 13  CustomerName            1000 non-null   object
 14  CustomerAddress         1000 non-null   object
 15  Customer_PhoneNumber    1000 non-null   object
 16  CustomerEmail           900 non-null    object
 17  Staff_Name              1000 non-null   object
 18  Staff_Email             900 non-null    object
 19  DayOfWeek               1000 non-null   object
 20  TotalSales              1000 non-null   float64
dtypes: bool(1), float64(3), int64(2), object(15)
memory usage: 165.0+ KB

In [29]:
#filling the int and float row with a mean value of the different column
int_row = data.select_dtypes(include=['float64', 'int64']).columns
for row in int_row:
    data.fillna({row:data[row].mean()},inplace=True)

In [31]:
###filling the string data types with 'Unknown'
string = data.select_dtypes(include='object').columns
for row in string:
    data.fillna({row:'Unknown'}, inplace=True)

In [32]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, 0 to 999
Data columns (total 21 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Date                    1000 non-null   object
 1   ProductName             1000 non-null   object
 2   Quantity                1000 non-null   int64
 3   UnitPrice               1000 non-null   float64
 4   StoreLocation           1000 non-null   object
 5   PaymentType             1000 non-null   object
 6   PromotionApplied        1000 non-null   bool
 7   Weather                 1000 non-null   object
 8   Temperature             1000 non-null   float64
 9   StaffPerformanceRating  1000 non-null   object
 10  CustomerFeedback        1000 non-null   object
 11  DeliveryTime_min        1000 non-null   int64
 12  OrderType               1000 non-null   object
 13  CustomerName            1000 non-null   object
 14  CustomerAddress         1000 non-null   object
 15  Customer_PhoneNumber    1000 non-null   object
 16  CustomerEmail           1000 non-null   object
 17  Staff_Name              1000 non-null   object
 18  Staff_Email             1000 non-null   object
 19  DayOfWeek               1000 non-null   object
 20  TotalSales              1000 non-null   float64
dtypes: bool(1), float64(3), int64(2), object(15)
memory usage: 165.0+ KB

In [33]:
data.columns

Index(['Date', 'ProductName', 'Quantity', 'UnitPrice', 'StoreLocation',
       'PaymentType', 'PromotionApplied', 'Weather', 'Temperature',
       'StaffPerformanceRating', 'CustomerFeedback', 'DeliveryTime_min',
       'OrderType', 'CustomerName', 'CustomerAddress', 'Customer_PhoneNumber',
       'CustomerEmail', 'Staff_Name', 'Staff_Email', 'DayOfWeek',
       'TotalSales'],
      dtype='object')

In [39]:
#creating different tables with the cleaned data above
staff = data[['Staff_Name', 'Staff_Email']].copy().drop_duplicates().reset_index(drop=True)
staff.index.name='staff_id'
staff = staff.reset_index()
staff.head()

   staff_id        Staff_Name              Staff_Email
0         0      John Bridges    pdavidson@example.com
1         1     Sarah Bentley     ajohnson@example.net
2         2  Connie Cervantes    michele29@example.net
3         3   Jessica Stewart      xwilson@example.org
4         4  Cheryl Carpenter  christine96@example.org

In [40]:
customer = data[['CustomerName', 'CustomerAddress', 'Customer_PhoneNumber','CustomerEmail']].copy().drop_duplicates().reset_index(drop=True)
customer.index.name='customer_id'
customer = customer.reset_index()
customer.head()

,customer_id,CustomerName,CustomerAddress,Customer_PhoneNumber,CustomerEmail
0,0,William Adams,"9851 David Green\r\nTonyaburgh, VA 02853",(916)427-7276x861,lisa00@example.net
1,1,Anthony Wiggins,"24682 Holly Stravenue\r\nMooreville, NH 13901",769.318.4373,michellefernandez@example.com
2,2,Ashley Duke,10184 Washington Trace Apt. 679\r\nEast Brandi...,702.520.3286,cooperwilliam@example.com
3,3,Brandon Taylor,"87194 Jeff Rue\r\nMitchellbury, CA 50463",622-527-9530,fsilva@example.net
4,4,Brittany Watkins,"850 Julia Groves\r\nHartview, WI 95954",759-517-8359,petersjoseph@example.net

In [41]:
product = data[['ProductName','UnitPrice']].copy().drop_duplicates().reset_index(drop=True)
product.index.name = 'product_id'
product = product.reset_index()
product.head()

   product_id      ProductName  UnitPrice
0           0     Vanilla Cake  12.532304
1           1  Red Velvet Cake   7.083070
2           2   Chocolate Cake   6.736064
3           3      Carrot Cake   7.314823
4           4  Pizza Pepperoni   7.577727

In [48]:
fact_table = data.merge(staff, on=['Staff_Name', 'Staff_Email'], how='left')\
              .merge(customer, on=['CustomerName', 'CustomerAddress', 'Customer_PhoneNumber','CustomerEmail'])\
              .merge(product, on=['ProductName','UnitPrice'])

fact_table.index.name = 'Transaction_id'
fact_table.reset_index()\
              [['Date','Transaction_id','product_id','StoreLocation','PaymentType', 'PromotionApplied', 'Weather', 'Temperature',
              'StaffPerformanceRating', 'CustomerFeedback', 'DeliveryTime_min','OrderType','customer_id','staff_id','DayOfWeek','TotalSales']]

,Date,Transaction_id,product_id,StoreLocation,PaymentType,PromotionApplied,Weather,Temperature,StaffPerformanceRating,CustomerFeedback,DeliveryTime_min,OrderType,customer_id,staff_id,DayOfWeek,TotalSales
0,2023-01-01 00:00:00,0,0,South,Cash,True,Rainy,20.654914,Poor,Neutral,30,In Store,0,0,Sunday,25.064608
1,2023-01-01 01:00:00,1,1,South,Cash,False,Rainy,23.549497,Average,Positive,33,In Store,1,1,Sunday,7.083070
2,2023-01-01 02:00:00,2,2,North,Cash,True,Rainy,27.154342,Excellent,Unknown,43,Phone Order,2,2,Sunday,33.680321
3,2023-01-01 03:00:00,3,3,North,Cash,False,Cloudy,20.137483,Poor,Positive,32,Online Order,3,3,Sunday,14.629647
4,2023-01-01 04:00:00,4,4,East,Credit Card,True,Cloudy,23.020987,Good,Neutral,58,In Store,4,4,Sunday,7.577727
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,2023-02-11 11:00:00,995,995,North,Credit Card,True,Rainy,28.787946,Poor,Negative,29,In Store,995,995,Saturday,22.449136
996,2023-02-11 12:00:00,996,996,East,Credit Card,False,Cloudy,34.641175,Good,Positive,32,In Store,996,996,Saturday,47.074995
997,2023-02-11 13:00:00,997,997,West,Cash,True,Sunny,27.984565,Average,Unknown,43,Phone Order,997,997,Saturday,32.379540
998,2023-02-11 14:00:00,998,998,East,Online,True,Rainy,33.579827,Poor,Positive,52,Online Order,998,998,Saturday,69.137870
999,2023-02-11 15:00:00,999,999,South,Credit Card,False,Sunny,21.245581,Average,Neutral,35,In Store,999,999,Saturday,15.561183

In [49]:
fact_table['Date'] = pd.to_datetime(fact_table['Date'])

In [50]:
fact_table.head()

,Date,ProductName,Quantity,UnitPrice,StoreLocation,PaymentType,PromotionApplied,Weather,Temperature,StaffPerformanceRating,...,CustomerAddress,Customer_PhoneNumber,CustomerEmail,Staff_Name,Staff_Email,DayOfWeek,TotalSales,staff_id,customer_id,product_id
Transaction_id,,,,,,,,,,,,,,,,,,,,,
0,2023-01-01 00:00:00,Vanilla Cake,2,12.532304,South,Cash,True,Rainy,20.654914,Poor,...,"9851 David Green\r\nTonyaburgh, VA 02853",(916)427-7276x861,lisa00@example.net,John Bridges,pdavidson@example.com,Sunday,25.064608,0,0,0
1,2023-01-01 01:00:00,Red Velvet Cake,1,7.083070,South,Cash,False,Rainy,23.549497,Average,...,"24682 Holly Stravenue\r\nMooreville, NH 13901",769.318.4373,michellefernandez@example.com,Sarah Bentley,ajohnson@example.net,Sunday,7.083070,1,1,1
2,2023-01-01 02:00:00,Chocolate Cake,5,6.736064,North,Cash,True,Rainy,27.154342,Excellent,...,10184 Washington Trace Apt. 679\r\nEast Brandi...,702.520.3286,cooperwilliam@example.com,Connie Cervantes,michele29@example.net,Sunday,33.680321,2,2,2
3,2023-01-01 03:00:00,Carrot Cake,2,7.314823,North,Cash,False,Cloudy,20.137483,Poor,...,"87194 Jeff Rue\r\nMitchellbury, CA 50463",622-527-9530,fsilva@example.net,Jessica Stewart,xwilson@example.org,Sunday,14.629647,3,3,3
4,2023-01-01 04:00:00,Pizza Pepperoni,1,7.577727,East,Credit Card,True,Cloudy,23.020987,Good,...,"850 Julia Groves\r\nHartview, WI 95954",759-517-8359,petersjoseph@example.net,Cheryl Carpenter,christine96@example.org,Sunday,7.577727,4,4,4

In [54]:
#saving file as csv files
product.to_csv('data/product.csv', index=False)
customer.to_csv('data/customer.csv', index=False)
staff.to_csv('data/staff.csv',index=False)
fact_table.to_csv('data/Transaction.csv', index=False)

In [9]:
#df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 21 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Date                    1000 non-null   object
 1   ProductName             1000 non-null   object
 2   Quantity                1000 non-null   int64
 3   UnitPrice               1000 non-null   float64
 4   StoreLocation           1000 non-null   object
 5   PaymentType             1000 non-null   object
 6   PromotionApplied        1000 non-null   bool
 7   Weather                 1000 non-null   object
 8   Temperature             1000 non-null   float64
 9   StaffPerformanceRating  1000 non-null   object
 10  CustomerFeedback        1000 non-null   object
 11  DeliveryTime_min        1000 non-null   int64
 12  OrderType               1000 non-null   object
 13  CustomerName            1000 non-null   object
 14  CustomerAddress         1000 non-null   object
 15  Customer_PhoneNumber    1000 non-null   object
 16  CustomerEmail           1000 non-null   object
 17  Staff_Name              1000 non-null   object
 18  Staff_Email             1000 non-null   object
 19  DayOfWeek               1000 non-null   object
 20  TotalSales              1000 non-null   float64
dtypes: bool(1), float64(3), int64(2), object(15)
memory usage: 157.4+ KB

In [ ]:
#dropping duplicate data
#df.drop_duplicates(inplace =True)

In [17]:
for column in df.columns:
    print(column, 'Null', df[column].isnull().sum())
    #(column)

Date Null 0
ProductName Null 0
Quantity Null 0
UnitPrice Null 0
StoreLocation Null 0
PaymentType Null 0
PromotionApplied Null 0
Weather Null 0
Temperature Null 0
StaffPerformanceRating Null 0
CustomerFeedback Null 0
DeliveryTime_min Null 0
OrderType Null 0
CustomerName Null 0
CustomerAddress Null 0
Customer_PhoneNumber Null 0
CustomerEmail Null 0
Staff_Name Null 0
Staff_Email Null 0
DayOfWeek Null 0
TotalSales Null 0

In [ ]:
#code to fill numeric columns with the mean of the column
fill = df.select_dtypes(include=['float64','int64']).columns
for col in fill:
    df.fillna({col: df[col].mean()}, inplace=True)

In [ ]:
string_col = df.select_dtypes(include=['object']).columns
for col in string_col:
    df.fillna({col: 'Unknown'}, inplace=True)

In [ ]:
#filling the missing values with the mean of the column
df.fillna({

})

In [2]:
spark = SparkSession.builder.master('local[4]').appName('lo').getOrCreate()
spark